DroneBridge/ESP32/main/main.c
    ESP_ERROR_CHECK(nvs_commit(my_handle));
    nvs_close(my_handle);
}

/**
 * Helper function to read a string from the NVS based on a key. Handles errors accordingly and print result to console
 *
 * @param my_handle nvs_handle to use
 * @param key NVS key as string with max length NVS_KEY_NAME_MAX_SIZE-1
 * @param dst Destination for the read value
 */
void db_read_str_nvs(nvs_handle my_handle, char *key, char *dst) {
    if (strlen(key) + 1 > NVS_KEY_NAME_MAX_SIZE)
        ESP_LOGW(TAG, "key %s is longer than %i bytes", key, NVS_KEY_NAME_MAX_SIZE);
    size_t required_size = 0;
    esp_err_t err = nvs_get_str(my_handle, key, NULL, &required_size);
    if (err == ESP_OK) {
        char *read_nvs_val = malloc(required_size);
        ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_str(my_handle, key, read_nvs_val, &required_size));
        memcpy(dst, read_nvs_val, required_size);
        free(read_nvs_val);
        ESP_LOGI(TAG, "\t%s: %s", key, dst);
    } else {
        ESP_LOGW(TAG, "Could not read key %s from NVS", key);
    }
}

/**
 * Read stored settings from internal storage including the saved UDP client.
 */
void db_read_settings_nvs() {
    nvs_handle my_handle;
    if (nvs_open(NVS_NAMESPACE, NVS_READONLY, &my_handle) != ESP_OK) {
        ESP_LOGI(TAG, "NVS namespace not found. Erasing flash, init NVS ...");
        nvs_close(my_handle);
        ESP_ERROR_CHECK(nvs_flash_erase());
        ESP_ERROR_CHECK(nvs_flash_init());
        db_write_settings_to_nvs();
    } else {
        ESP_LOGI(TAG, "Reading settings from NVS");
        db_read_str_nvs(my_handle, "ssid", (char *) DB_WIFI_SSID);
        db_read_str_nvs(my_handle, "wifi_pass", (char *) DB_WIFI_PWD);
        db_read_str_nvs(my_handle, "ap_ip", DEFAULT_AP_IP);
        db_read_str_nvs(my_handle, "ip_sta", DB_STATIC_STA_IP);
        db_read_str_nvs(my_handle, "ip_sta_gw", DB_STATIC_STA_IP_GW);
        db_read_str_nvs(my_handle, "ip_sta_netmsk", DB_STATIC_STA_IP_NETMASK);
        ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u8(my_handle, "esp32_mode", &DB_WIFI_MODE));
        ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u8(my_handle, "wifi_chan", &DB_WIFI_CHANNEL));
        ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_i32(my_handle, "baud", &DB_UART_BAUD_RATE));
        ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u8(my_handle, "gpio_tx", &DB_UART_PIN_TX));
        ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u8(my_handle, "gpio_rx", &DB_UART_PIN_RX));
        ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u8(my_handle, "gpio_cts", &DB_UART_PIN_CTS));
        ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u8(my_handle, "gpio_rts", &DB_UART_PIN_RTS));
        ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u8(my_handle, "rts_thresh", &DB_UART_RTS_THRESH));
        ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u8(my_handle, "proto", &DB_SERIAL_PROTOCOL));
        ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u16(my_handle, "trans_pack_size", &DB_TRANS_BUF_SIZE));
        ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u16(my_handle, "serial_timeout", &DB_SERIAL_READ_TIMEOUT_MS));
        ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u8(my_handle, "ltm_per_packet", &DB_LTM_FRAME_NUM_BUFFER));
        ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u8(my_handle, "dis_wifi_arm", &DB_DISABLE_WIFI_ARMED));
        // get saved UDP client - this read might result in an error if no client was saved prev. by the user
        char udp_client_ip_str[INET_ADDRSTRLEN + 6];
        udp_client_ip_str[0] = '\0';
        db_read_str_nvs(my_handle, "udp_client_ip", udp_client_ip_str);
        uint16_t udp_client_port = 0;
        ESP_ERROR_CHECK_WITHOUT_ABORT(nvs_get_u16(my_handle, "udp_client_port", &udp_client_port));

        // close NVM
        nvs_close(my_handle);
        ESP_LOGI(TAG,
                 "\tWifi Mode: %i\n\twifi_chan %i\n\tbaud %liu\n\tgpio_tx %i\n\tgpio_rx %i\n\tgpio_cts %i\n\t"
                 "gpio_rts %i\n\trts_thresh %i\n\tproto %i\n\ttrans_pack_size %i\n\tltm_per_packet %i\n\tserial_timeout %i",
                 DB_WIFI_MODE, DB_WIFI_CHANNEL, DB_UART_BAUD_RATE, DB_UART_PIN_TX, DB_UART_PIN_RX,
                 DB_UART_PIN_CTS, DB_UART_PIN_RTS, DB_UART_RTS_THRESH, DB_SERIAL_PROTOCOL, DB_TRANS_BUF_SIZE,
                 DB_LTM_FRAME_NUM_BUFFER, DB_SERIAL_READ_TIMEOUT_MS);
        if (strlen(udp_client_ip_str) > 0 && udp_client_port != 0) {
            // there was a saved UDP client in the NVM - add it to the udp clients list
            ESP_LOGI(TAG, "Adding %s:%i to known UDP clients.", udp_client_ip_str, udp_client_port);
            struct sockaddr_in new_sockaddr;
            memset(&new_sockaddr, 0, sizeof(new_sockaddr));
            new_sockaddr.sin_family = AF_INET;
            inet_pton(AF_INET, udp_client_ip_str, &new_sockaddr.sin_addr);
            new_sockaddr.sin_port = htons(udp_client_port);
            struct db_udp_client_t new_udp_client = {
                    .udp_client = new_sockaddr,
                    .mac = {0, 0, 0, 0, 0, 0}   // dummy MAC
            };
            bool save_to_nvm = false;   // no need to save it to NVM again
            add_to_known_udp_clients(udp_conn_list, new_udp_client, save_to_nvm);
        } else {
            // no saved UDP client - do nothing
        }
    }
}

/**
 * Callback for a short press (<CONFIG_BUTTON_SHORT_PRESS_TIME_MS) of the reset/boot button.
 * Sets mode to WiFi access point mode with default password "dronebridge" so user can check/change the config
 * @param arg
 */
void short_press_callback(void *arg, void *usr_data) {
    ESP_LOGW(TAG, "Short press detected setting wifi mode to access point with password: dronebridge");
    DB_WIFI_MODE_DESIGNATED = DB_WIFI_MODE_AP;  // do not directly change DB_WIFI_MODE since it is not safe and constantly processed by other tasks. Save settings and reboot will assign DB_WIFI_MODE_DESIGNATED to DB_WIFI_MODE.
    strncpy((char *) DB_WIFI_SSID, "DroneBridge for ESP32", sizeof(DB_WIFI_SSID) - 1);
    strncpy((char *) DB_WIFI_PWD, "dronebridge", sizeof(DB_WIFI_PWD) - 1);
    db_write_settings_to_nvs();
    esp_restart();
}

/**
 * Callback for a long press (>CONFIG_BUTTON_LONG_PRESS_TIME_MS) of the reset/boot button.
 * Resets all settings to defaults.
 * @param arg
 */
void long_press_callback(void *arg, void *usr_data) {
    ESP_LOGW(TAG, "Reset triggered via GPIO %i. Resetting settings and rebooting", DB_RESET_PIN);
    DB_WIFI_MODE_DESIGNATED = DB_WIFI_MODE_AP;  // do not directly change DB_WIFI_MODE since it is not safe and constantly processed by other tasks. Save settings and reboot will assign DB_WIFI_MODE_DESIGNATED to DB_WIFI_MODE.
    strncpy((char *) DB_WIFI_SSID, "DroneBridge for ESP32", sizeof(DB_WIFI_SSID) - 1);
    strncpy((char *) DB_WIFI_PWD, "dronebridge", sizeof(DB_WIFI_PWD) - 1);
    strncpy(DEFAULT_AP_IP, "192.168.2.1", sizeof(DEFAULT_AP_IP) - 1);
    memset(DB_STATIC_STA_IP, 0, strlen(DB_STATIC_STA_IP));
    memset(DB_STATIC_STA_IP_GW, 0, strlen(DB_STATIC_STA_IP_GW));
    memset(DB_STATIC_STA_IP_NETMASK, 0, strlen(DB_STATIC_STA_IP_NETMASK));
    DB_WIFI_CHANNEL = 6;
    DB_UART_PIN_TX = DB_DEFAULT_UART_TX_PIN;
    DB_UART_PIN_RX = DB_DEFAULT_UART_RX_PIN;
    DB_UART_PIN_CTS = DB_DEFAULT_UART_CTS_PIN;
    DB_UART_PIN_RTS = DB_DEFAULT_UART_RTS_PIN; //
    DB_UART_BAUD_RATE = DB_DEFAULT_UART_BAUD_RATE;
    DB_SERIAL_PROTOCOL = DB_SERIAL_PROTOCOL_MAVLINK;
    DB_DISABLE_WIFI_ARMED = false;
    DB_TRANS_BUF_SIZE = 128;
    DB_UART_RTS_THRESH = 64;
    DB_SERIAL_READ_TIMEOUT_MS = DB_SERIAL_READ_TIMEOUT_MS_DEFAULT;
    db_write_settings_to_nvs();
    esp_restart();
}

/**
 * Setup boot button GPIO to reset entire ESP32 settings and to force a reboot of the system
 */
void set_reset_trigger() {
    button_config_t gpio_btn_cfg = {
            .type = BUTTON_TYPE_GPIO,
            .long_press_time = CONFIG_BUTTON_LONG_PRESS_TIME_MS,
            .short_press_time = CONFIG_BUTTON_SHORT_PRESS_TIME_MS,
            .gpio_button_config = {
                    .gpio_num = DB_RESET_PIN,
                    .active_level = 0,
            },
    };
    button_handle_t gpio_btn = iot_button_create(&gpio_btn_cfg);
    if (NULL == gpio_btn) {
        ESP_LOGE(TAG, "Creating reset button failed");
    } else {
        iot_button_register_cb(gpio_btn, BUTTON_SINGLE_CLICK, short_press_callback, NULL);
        iot_button_register_cb(gpio_btn, BUTTON_LONG_PRESS_UP, long_press_callback, NULL);
    }
}

/**
 * For simple debugging when serial via JTAG is enabled. Printed once control module configured USB serial socket.
 * Write settings to JTAG/USB, so we can debug issues better
 */
void db_jtag_serial_info_print() {
    uint8_t buffer[512];
    int len = sprintf((char *) buffer,
                      "\tWifi Mode: %i\n\twifi_chan %i\n\tbaud %liu\n\tgpio_tx %i\n\tgpio_rx %i\n\tgpio_cts %i\n\t"
                      "gpio_rts %i\n\trts_thresh %i\n\tproto %i\n\ttrans_pack_size %i\n\tltm_per_packet %i\n\tserial_timeout %i\n\tdis_wifi_arm %i\n",
                      DB_WIFI_MODE, DB_WIFI_CHANNEL, DB_UART_BAUD_RATE, DB_UART_PIN_TX, DB_UART_PIN_RX,
                      DB_UART_PIN_CTS, DB_UART_PIN_RTS, DB_UART_RTS_THRESH, DB_SERIAL_PROTOCOL, DB_TRANS_BUF_SIZE,
                      DB_LTM_FRAME_NUM_BUFFER, DB_SERIAL_READ_TIMEOUT_MS, DB_DISABLE_WIFI_ARMED);
    write_to_serial(buffer, len);
    len = sprintf((char *) buffer, "\tSSID: %s\n", DB_WIFI_SSID);
    write_to_serial(buffer, len);
    len = sprintf((char *) buffer, "\tPassword: %s\n", DB_WIFI_PWD);
    write_to_serial(buffer, len);
    len = sprintf((char *) buffer, "\tAP IP: %s\n", DEFAULT_AP_IP);
    write_to_serial(buffer, len);
    len = sprintf((char *) buffer, "\tStatic IP: %s\n", DB_STATIC_STA_IP);
    write_to_serial(buffer, len);
    len = sprintf((char *) buffer, "\tStatic IP gateway: %s\n", DB_STATIC_STA_IP_GW);
    write_to_serial(buffer, len);
    len = sprintf((char *) buffer, "\tStatic IP netmask: %s\n", DB_STATIC_STA_IP_NETMASK);
    write_to_serial(buffer, len);
    ESP_LOGI(TAG, "Wrote to serial!");
}

/**
 * Enables or disables (via reboot) the WiFi if the DB_DISABLE_WIFI_ARMED parameter is set. Not used during boot.
 * Usually called when arm state change of the autopilot is detected. As internal check if the WiFi is already enabled/disabled
 * WiFi must be inited first (done during boot).
 * @param enable_wifi True to enable the WiFi and FALSE to disable it
 */
void db_set_wifi_status(uint8_t enable_wifi) {
    static uint8_t db_wifi_is_off = false;  // keep track if we switched WiFi off already
    if (DB_DISABLE_WIFI_ARMED) {    // check if that feature is enabled by the user
        if (enable_wifi && db_wifi_is_off) {
            esp_restart(); // enable WiFi by restarting ESP32 - easy way to make sure all things are set up right
        } else if (!db_wifi_is_off) {
            if (esp_wifi_stop() == ESP_OK) { // disable WiFi
                db_wifi_is_off = true;
            } else {
                ESP_LOGW(TAG, "db_set_wifi_status tried to disable Wi-Fi. FAILED");
            }
        }
    } else {
        // nothing to do
    }
}

/**
 * Main entry point.
 * Client Mode: ESP32 connects to a known access point.
 * If the ESP32 could not connect to the specified access point using WIFI_ESP_MAXIMUM_RETRY retries, the
 * ESP32 will switch temporarily to access point mode to allow the user to check the configuration. On reboot of the
 * ESP32 the WiFi client mode will be re-enabled if not changed otherwise by the user.
 *
 * AP-Mode: ESP32 creates an WiFi access point of its own where the ground control stations can connect
 */
void app_main() {
    udp_conn_list = udp_client_list_create();   // http server functions and db_read_settings_nvs expect the list to exist
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);
    db_read_settings_nvs();
    DB_WIFI_MODE_DESIGNATED = DB_WIFI_MODE; // must always match, mismatch only allowed when changed by user action and not rebooted, yet.
    set_reset_trigger();
    if (DB_WIFI_MODE == DB_WIFI_MODE_AP || DB_WIFI_MODE == DB_WIFI_MODE_AP_LR) {
        init_wifi_apmode(DB_WIFI_MODE);
    } else if (DB_WIFI_MODE == DB_WIFI_MODE_ESPNOW_AIR || DB_WIFI_MODE == DB_WIFI_MODE_ESPNOW_GND) {
        init_wifi_espnow();
        db_espnow_module();
    } else {
        // Wi-Fi client mode with LR mode enabled
        if (init_wifi_clientmode() < 0) {
            ESP_LOGE(TAG, "Failed to init Wifi Client Mode");
        }
    }

    if (DB_WIFI_MODE != DB_WIFI_MODE_ESPNOW_AIR && DB_WIFI_MODE != DB_WIFI_MODE_ESPNOW_GND) {
        // no need to start these services - won`t be available anyway - safe the resources
        start_mdns_service();
        netbiosns_init();
        netbiosns_set_name("dronebridge");
    }

    ESP_ERROR_CHECK(init_fs());
    control_module();

    if (DB_WIFI_MODE != DB_WIFI_MODE_ESPNOW_AIR && DB_WIFI_MODE != DB_WIFI_MODE_ESPNOW_GND) {
        // no need to start these services - won`t be available anyway - safe the resources
        ESP_ERROR_CHECK(start_rest_server(CONFIG_WEB_MOUNT_POINT));
        ESP_LOGI(TAG, "Rest Server started");
        // Disable legacy support for DroneBridge communication module - no use case for DroneBridge for ESP32
        // communication_module();
    }
    ESP_LOGI(TAG, "app_main finished initial setup");
}
